<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 限速器 key 前缀
    |--------------------------------------------------------------------------
    |
    | 如果有多个应用存在 key 重复的可能你可以设置一个适当的前缀，如果你确定没有重复的可能可忽略。
    |
    */

    'key_prefix' => '',

    /*
    |--------------------------------------------------------------------------
    | 限速器
    |--------------------------------------------------------------------------
    |
    | 如果为空，默认使用 Illuminate\Cache\RateLimiter
    | 如果要自定义限速器实现，要确保其实现 Jiaxincui\Throttler\Contracts\Limiter 接口
    |
    */

    'limiter' => '',

    /*
    |--------------------------------------------------------------------------
    | 限速方案
    |--------------------------------------------------------------------------
    |
    | 在使用中没有明确指定 guard 将使用 default 作为限速方案。
    | 每个方案可以设置多条策略，如 default 方案限制每秒钟5次，并且每分钟10次，每小时50次，每24小时100次，可以像下面这样设置:
    | 'default' => [
    |   [5, 1],
    |   [10, 60],
    |   [50, 60*60],
    |   [100, 60*60*24]
    |  ]
    |
    | 也可以设置多条方案，如下将设置一个 custom1 的方案:
    |  'custom' => [
    |    [5, 1],
    |    [10, 60]
    |   ]
    |
    */

    'guards' => [
        'default' => [
            [5, 1]
        ],

        'custom' => [
        ]
    ]
];
